Table of Contents
 Class Vector2D
Namespace
IdeaRS.OpenModel.Geometry2D
Assembly
IdeaRS.OpenModel.dll
Represents a vector in two-dimensional space.
[OpenModelClass("System.Windows.Vector, WindowsBase")]
public class Vector2D : OpenObject
Inheritance
object
OpenObject
Vector2D
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 X
Gets or sets the X-dirrection value
public double X { get; set; }
Property Value
double
 Y
Gets or sets the Y-dirrection value
public double Y { get; set; }
Property Value
double
 Edit this page